{"meta":{"title":"Hanfeng Zhai","subtitle":"ein denken Mensch","description":"翟晗锋","author":"B.S. student @ SHU","url":"www.hanfengzhai.net","root":"/"},"pages":[{"title":"","date":"2020-12-27T16:00:00.000Z","updated":"2020-12-30T14:30:59.724Z","comments":true,"path":"about/index.html","permalink":"www.hanfengzhai.net/about/index.html","excerpt":"","text":"BIO Born and raised in Beijing, China, I am an undergraduate student currently studying at Shanghai University in Shanghai. I went to Beijing No.12 High School for high school and High School Affiliated to Renmin University of China for middle school. I grew up and recieved my primary education in Experimental Primary School of Beijing Normal University, in which I started learning playing tuba and doing arts. Enthusiastic about both solid and fluid mechanics, I’ve engaged in research projects ranging from the designing of bio-inspired hierarchical materials with superior mechanical properties to numerical studies and algorithms of fluid mechanics problems. I’m passionate on learning the most cutting-edge knowledge and exploring the world of mechanics. My previous undergraduate research projects can be viewed in my projects. Main Research Interests ________________________________________________________ Computational fluid dynamics and numerical methods Machine learning algorithms for fluid dynamics Microscopic and nanoscopic mechanical phenomena Extracurricular Activities _______________________________________________________ As a mechanics student, I am also a student having a wide range of interests. I am a zealot of sport. I was the Defensive End and Linebacker at Shanghai University Football Team (Bombers). And I also got the privilige to meet Russell Wilson (Media coverage on AFInt) and training with him in Shanghai. I have won the 1st and 3rd place in the school’s bodybuilding contest in 2018 and 2019. I have experience in financial training at Bank of China Life at Hong Kong on Feburary 2018. I also love painting, arts, and all sorts of things that can excites me. In my spare time, I love watching movies and do sports, and I also love history, philosophy, and social science."},{"title":"个人主页","date":"2020-10-11T06:47:59.819Z","updated":"2020-10-11T06:47:59.819Z","comments":false,"path":"categories/cn.html","permalink":"www.hanfengzhai.net/categories/cn.html","excerpt":"","text":"简介 _________________________________ 个人项目 _________________________________"},{"title":"","date":"2020-10-28T02:35:55.551Z","updated":"2020-10-09T06:38:32.944Z","comments":false,"path":"categories/index.html","permalink":"www.hanfengzhai.net/categories/index.html","excerpt":"","text":"Code We have release the opensource code for mesoscopic simulations. NotePublications"},{"title":"","date":"2020-10-10T12:59:40.686Z","updated":"2020-10-09T02:16:54.476Z","comments":false,"path":"categories/news.html","permalink":"www.hanfengzhai.net/categories/news.html","excerpt":"","text":"ResearchLinks"},{"title":"LINKS","date":"2020-12-23T08:41:58.572Z","updated":"2020-12-23T08:41:58.572Z","comments":false,"path":"categories/links.html","permalink":"www.hanfengzhai.net/categories/links.html","excerpt":"","text":"Here are the links for useful learning resources. TensorFlow PyTorch Nektar++"},{"title":"NOTES","date":"2019-11-29T16:00:00.000Z","updated":"2021-01-04T06:27:32.441Z","comments":false,"path":"categories/note.html","permalink":"www.hanfengzhai.net/categories/note.html","excerpt":"","text":"Seminars _________________________ Neural Network on Aeronautic Noise Predictions. Supervised by Guohui Hu. 12/7/2020: Progress update on neural network predictions on acoustic pressure field. [PDF] 12/21/2020: Paper review of Fourier Neural Operator for Parametric Partial Differential Equations. [PDF] Biomechanics Research on Enamel Microstructure. Supervised by Dongsheng Zhang &amp; Dwayne D. Arola. Observation on enamel’s decussation bands. [PDF] Modelling on enamel’s structure in 3D. [PDF] Progress on the new observations and simulations. [PDF] New observations and strategies for structural modeling. [PDF] New observations and measurements for modeling. [PDF] Parameters measurements for microstructural modeling. [PDF] Reports for update on 3D printing on modeling. [PDF] Learning Notes ___________________________________ Computational Fluid Dynamics. Taught by Xiaoquan Yang. SHU 01826063 (2020). 1. Introduction to CFD. [PDF] 2. Nondimensionalization. [PDF] 3. Finite Volume Method. [PDF] 4. Finite Difference Method. [PDF] 5. Boundary Conditions. [PDF] 6. Artificial Dissipation. [PDF] 7. Meshing Transformation &amp; Viscosity Discretization. [PDF] 8. Implicit Difference Scheme. [PDF] Navier-Stokes Equation. [PDF] Smoothed-Particles Hydrodynamics. [Slides] | [BiliBili] | [YouTube] Finite Volume Method &amp; Shock Tube Problem. [Slides] | [BiliBili] | [YouTube] Mathematical Model of Neural Network. [PDF] Buckling of a Thin Plate. [Slides] | [BiliBili]"},{"title":"PROJECTS","date":"2019-11-29T16:00:00.000Z","updated":"2020-12-31T06:42:47.985Z","comments":false,"path":"categories/project.html","permalink":"www.hanfengzhai.net/categories/project.html","excerpt":"","text":"Undergraduate Projects ______________________________________________________ Research Projects S. Liu, H. Zhai, et al. Biomechanics Research. National Natural Science Foundation of China (2019). Principle: Profs. Dongsheng Zhang &amp; Dwayne D. Arola. Course Projects H. Zhai. Structural design of composite materials with superior mechanical behaviors: lesson from the microstructure of nacre and enamel. CAD Application in Structural Mechanics (2020). Supervisor: Prof. Bingbing An. [PDF] H. Zhai. Formulation and application of rate-independent stress update algorithm of hydrostatic pressure: elastoplastic yielding in composite. Plasticity Theory (2020). Supervisor: Prof. Bingbing An. [PDF] H. Zhai. Investigation of the mechanics of the airfoil: application of machine learning in the noise prediction of NACA 0012. Research methods (Fluid Physics on Flight) (2020). Supervisor: Profs. Yuhong Dong &amp; Xiaoquan Yang. [PDF] H. Zhai, S. Weng, B. Liang, C. Tang, Z. Wang. Structural Design of Lightweight Compressive Interlayer (in Chinese). Finite Element and Its Applications (2019). Supervisor: Prof. Yicheng Song. [Poster] H. Zhai. The FEM Simulation and Estimation of the Library of Shanghai University &amp; The Simulation and Estimation of the Fracture of Taiwan’s Nanfang’ao Bridge (in Chinese). Finite Element and Its Applications (2019). Supervisor: Prof. Yicheng Song. [PDF] H. Zhai, H. Wen, W. Xie. The curve fitting of the tension and frequency of the Guitar string vibration (in Chinese). Experimental Mechanics (2019). Supervisor: Prof. Kai Li. [PDF] H. Zhai. Linear Regression on Concrete Compressive Strength (in Chinese). Machine Learning and Mechanics (2019). Supervisor: Prof. Guohui Hu. [PDF] H. Zhai. Decision Tree Estimation on Frigate Propulsion Velocity (in Chinese). Machine Learning and Mechanics (2019). Supervisor: Prof. Guohui Hu. [PDF] H. Zhai. Naïve Bayes classification calculation on Yacht Hydrodynamics Data Set (in Chinese). Machine Learning and Mechanics (2019). Supervisor: Prof. Guohui Hu. [PDF] H. Zhai. Thermal Estimation of Smartphone Chipset: Mechanical Distribution of Chipset in Multiphysics Field. Elastic Mechanics (2019). Supervisor: Prof. Junqian Zhang. [PDF] | [Slides] Training Programs H. Zhai, S. Diao, S. Weng. Design of Intelligent Tuning Equipment for Stringed Instruments. National College Student Innovation and Entrepreneurship Project (2019-2020). Supervisor: Prof. Kai Li. {#201910280001}. [Report] | [Poster] H. Zhai, K. Wang, Z. Liu. An optimized algorithm for the prediction of the water emptying time on BPNN. UC Berkeley Online Research Program (2020). Supervisor: Prof. Reza Alam. [PDF] | [Slides] | [Code] H. Zhai. An investigation of the elastoplastic nature of ITD on the toughness of the dentin microstructure. SHU Summer Research Program (2020). Supervisor: Prof. Bingbing An. [PDF] H. Zhai, S. Weng. Beam force calculation GUI development (MATLAB). SHU Summer Research Program (2019). Supervisor: Prof. Yongqi Ma. [Code]"},{"title":"PUBLICATIONS","date":"2019-11-29T16:00:00.000Z","updated":"2020-12-31T06:43:16.098Z","comments":false,"path":"categories/publications.html","permalink":"www.hanfengzhai.net/categories/publications.html","excerpt":"","text":"S. Liu, H. Zhai, Y. Xu, B. An*, D. Zhang*. The Role of Rod Decussation on Crack Deflection in Enamel, submitted to Biomechanics and Modeling in Mechanobiology. 2020 (Under Review)."},{"title":"Research","date":"2020-10-11T08:25:00.557Z","updated":"2020-10-11T04:48:38.608Z","comments":false,"path":"categories/research.html","permalink":"www.hanfengzhai.net/categories/research.html","excerpt":"","text":"Main Topics _________________________________"},{"title":"","date":"2020-10-10T11:33:50.263Z","updated":"2020-10-09T02:16:54.476Z","comments":false,"path":"tags/index.html","permalink":"www.hanfengzhai.net/tags/index.html","excerpt":"","text":"ResearchLinks"},{"title":"Biomechanical composite material structural design","date":"2020-06-21T16:00:00.000Z","updated":"2020-10-07T06:36:33.906Z","comments":true,"path":"categories/code/CAD.html","permalink":"www.hanfengzhai.net/categories/code/CAD.html","excerpt":"AbstractBiomaterials like nacre and tooth enamel display spectacular mechanical properties such as high stiffness, high strength, high toughness, and fracture durability. Such properties are exhibited by their natural developed structures, both employ common characteristics: consisting of hard mineral inclusions and soft protein matrix. Here, we build models, representative, for nacre, and enamel consisting of hard inclusions and soft matrix, respectively.","text":"AbstractBiomaterials like nacre and tooth enamel display spectacular mechanical properties such as high stiffness, high strength, high toughness, and fracture durability. Such properties are exhibited by their natural developed structures, both employ common characteristics: consisting of hard mineral inclusions and soft protein matrix. Here, we build models, representative, for nacre, and enamel consisting of hard inclusions and soft matrix, respectively. We give the soft matrix a plastic property based on their natural mechanics. We thence calculate the 1 and 2-directional stiffness of the two structures and present their von Mises’ stress, directional stress, and directional strain distribution, respectively. For what is more, we estimate the fracture resistance of the two structures based on the assumption that the failure occurs on the soft matrix in which the shear stress reaches a critical value. We hence deduce that the nacre displays better 1-directional stiffness and enamel displays better 2-directional stiffness. The shear stress-displacement diagrams in each direction are also presented indicating the nacre is more likely to fail in 1-direction and enamel is more likely in 2-direction. Based on the results we present an optimized model taking the characters from both the nacre and enamel. Results show that the optimized model exhibits higher stiffness in both the two directions and evidently better crack resistance in 2-direction. Method Result Reference[1] B. An. Constitutive modeling the plastic deformation of bone-like materials. International Journal of Solids and Structures 92–93 (2016) 1–8[2] B. An, Y. Liu, D. Arola, D. Zhang. Fracture toughening mechanism of cortical bone: an experimental and numerical approach. J. Mech. Behav. Biomed. Mater., 4 (2011), pp. 983-992[3] An B., Zhang D. Bioinspired toughening mechanism: lesson from dentin. Bioinspir. Biomim., 10 (2015), Article 046010[4] B. An, H. D. Wagner. Role of microstructure on fracture of dentin. Journal of the Mechanical Behavior of Biomedical Materials. Vol 59 (2016): 527-537. ISSN 1751-6161.[5] M. Mirkhalafa, A. Sunesarab, B. Ashrafib, F. Barthelata. Toughness by segmentation: Fabrication, testing and micromechanics of architectured ceramic panels for impact applications. International Journal of Solids and Structures 158 (2019) 52–65[6] Godaa M. Assidib S. Belouettarb J.F. Ganghoffera. A micropolar anisotropic constitutive model of cancellous bone from discrete homogenization. J. Mech. Behav. Biomed. Mater., 2012; Vol 16: 87-108[7] Zhang Z., Zhang Y., Gao H. On optimal hierarchy of load-bearing biological materials. Proc. R. Soc. B, 278 (2011), pp. 519-525[8] Su Y, Wang L, Wu X, Yi C, Yang M, Yan D, Cheng K, Cheng X. The spatial differences in bone mineral density and hip structure between low-energy femoral neck and trochanteric fractures in elderly Chinese using quantitative computed tomography. Bone, Vol 12[9] B. Wang, X. Hub, P. Lua. Modelling and testing of large-scale masonry elements under three- T point bending – Tough and strong nacre-like structure enlarged by a factor of 20,000. Engineering Fracture Mechanics 229 (2020) 106961[10] Horacio, Decanini &amp; Juster, Allison &amp; Latourte, Félix &amp; Loh, Owen &amp; Grégoire, David &amp; Zavattieri, Pablo. (2011). Tablet-level origin of toughening in abalone shells and translation to synthetic composite materials. Nature communications. 2. 173. 10.1038/n[11] F Barthelat. Nacre from mollusk shells: a model for high-performance structural materials. Bioinsp. Biomim. 5 (2010) 035001 (8pp)[12] A. Ghazlana, T. Ngoa, T. Lea, T. Nguyena, A. Remennikov. Blast performance of a bio-mimetic panel based on the structure of nacre – A numerical study. Composite Structures 234 (2020) 111691.[13] A. Shi, Y. Li, W. Liu, J. Xu, D. Yan, J. Lei, Z. Li. Highly thermally conductive and mechanically robust composite of linear ultrahigh molecular weight polyethylene and boron nitride via constructing nacre-like structure. Composites Science and Technology[14] D. Bajaj, D. Arola. Role of prism decussation on fatigue crack growth and fracture of human enamel. Acta Biomaterialia 5 (2009) 3045–3056.[15] M. Yahyazadehfar, D. Bajaj, D. Arola. Hidden contributions of the enamel rods on the fracture resistance of human teeth. Acta Biomaterialia 9 (2013) 4806–4814[16] M. Yahyazadehfar, D. Arola. The role of organic proteins on the crack growth resistance of human enamel. Acta Biomaterialia 19 (2015) 33–45.[17] N. Zhang, X. Wang, W. Xiang, Y. Zhong, F. Yana, B. Jiang. Hierarchy structure and fracture mechanisms of the wild wolf tusk’s enamel. Materials Science &amp; Engineering C 106 (2020) 110277.[18] J. Koldehoff, M. V. Swain, G. A. Schneider. The geometrical structure of interfaces in dental enamel: A FIB-STEM investigation. Acta Biomaterialia 104 (2020) 17–27."},{"title":"","date":"2020-10-15T12:34:12.451Z","updated":"2020-10-01T04:53:42.929Z","comments":true,"path":"note/cfd/1.html","permalink":"www.hanfengzhai.net/note/cfd/1.html","excerpt":"","text":"CFD .line-limit-length { display: -webkit-box; -webkit-box-orient: vertical; -webkit-line-clamp: 2; word-break: break-all; overflow: hidden; } .content { word-break: break-all; word-wrap: break-word; } 1/9 您的浏览器不支持 audio 标签2/9 3/9 4/9 5/9 6/9 7/9 8/9 9/9出口成章，跃然纸上Powered by iFlytek /* window.onload = function(){ alert(\"接有关部门通知，暂时停止北京鲁谷机房的多媒体文件共享服务（云端部署服务器所在地），预计五月初可以恢复，给您带来的不便，敬请谅解。\"); } */ var wxData=new WxData(); chatJSON = $('#wchattext').val(); var realDesc=\"\"; // if(chatJSON.length>2){ // jsobj = JSON.parse(chatJSON); // for(i=0;i35){ // realDesc=realDesc.substr(0,35); // realDesc+=\"...\"; // break; // }else{ // realDesc += substr; // } // } // } wxData.get_all_token(window.location.href); function confirmEnding(str, target) { // 请把你的代码写在这里 var start = str.length-target.length; var arr = str.substr(start,target.length); if(arr == target){ return true; } } videoImgUrl=$(\"#wchatVideoPreview\").val(); // alert(videoImgUrl); if(confirmEnding(videoImgUrl, '/')){ videoImgUrl=videoImgUrl.substring(0,videoImgUrl.lastIndexOf('/')) } //alert(videoImgUrl); wxData.populate(videoImgUrl,$(\"#wchatWeikeName\").val(),realDesc); function hiddenTip(){ $(\".sxb-top-tips\").hide(); } function weixinImgClick() { var imgsurl = []; var nowurl = ''; var imgObj = $(\".imgView\"); for (var i = 0; i < imgObj.length; i++) { imgsurl[i] = imgObj[i].src; console.log(imgObj[i].src); nowurl=imgObj[i].src; // imgObj[i].onclick = function() { // nowurl = this.src; // console.log(1); // wx.previewImage({ // current : nowurl, // urls : imgsurl // }); // } $(\"#handimg\"+i).click (function() { wx.previewImage({ current : nowurl, urls : imgsurl }); }); } } function weixinClick(nowSrc){ var imgsurl = []; var nowurl = ''; var imgObj = $(\".imgView\"); for (var i = 0; i < imgObj.length; i++) { imgsurl[i] = imgObj[i].src; } wx.previewImage({ current : nowSrc, urls : imgsurl }); }; $(function() { var rootPath = getRootPath(); //点击穿透解决方案 FastClick.attach(document.body); var noteId = \"\"; noteId = '97d201c1f1c04a9b926e230a702f0b23'; var u = navigator.userAgent; var isAndroid = u.indexOf('Android') > -1 || u.indexOf('Adr') > -1; //android终端 var isiOS = !!u.match(/\\(i[^;]+;( U;)? CPU.+Mac OS X/); //ios终端 var os = \"android\"; if (isiOS) { os = \"ios\"; } $.ajax({ url : rootPath + '/noteShareHtml.action', type : 'POST', async : false, dataType : 'html', data : { shareId : noteId, osType : os }, success : function(result) { // $('#share_detail').html(result); var need = result.indexOf(\"needRefresh\")>-1; if(need){ setTimeout(function(){ //使用 setTimeout（）方法设定定时2000毫秒 window.location.reload();//页面刷新 },30000); } $('#share_detail').append(result); if (isiOS) { audios = $('.audio').audioPlayer(); // $('.audioplayer').each(function(){ // var thisPlayer = this; // $(this).find('.audioplayer-playpause').on('click',function(){ // myaudio = audios[0]; // myaudio.pause(); // }) // }); return; } var audios = document.getElementsByTagName(\"audio\"); // 暂停函数 function pauseAll() { var self = this; [].forEach.call(audios, function (i) { // 将audios中其他的audio全部暂停 i !== self && i.pause(); }) } // 给play事件绑定暂停函数 [].forEach.call(audios, function (i) { i.addEventListener(\"play\", pauseAll.bind(i)); }) // weixinImgClick(); }, error : function() { } }); // setTimeout(function() { // var myScroll = new BScroll('.sxb-scroll', { // scrollbar : { // fade : true, // interactive : false // // 1.8.0 新增 // } // }); // }, 2000); });"},{"title":"","date":"2020-12-08T09:52:39.373Z","updated":"2020-12-08T09:52:39.373Z","comments":true,"path":"about/template.html","permalink":"www.hanfengzhai.net/about/template.html","excerpt":"","text":"Presentation for thermal estimation of smartphone chip Click for presentation file. Click for the course paper."},{"title":"Forum Presentation","date":"2020-12-29T16:00:00.000Z","updated":"2020-12-31T05:39:15.594Z","comments":false,"path":"categories/UAF_2020.html","permalink":"www.hanfengzhai.net/categories/UAF_2020.html","excerpt":"","text":"Shanghai University Undergraduate Academic Forum The Shanghai University Undergraduate Academic Forum is a forum initiated by Shanghai University to inspire prospective undergraduate students to present their research works and further idea exchange. Hanfeng delivered a presentation titled “Computation Methods for Applied Mechanics Problem” covering his previous works on applying simulation and analytical mathematical analysis to tackle both solid and fluid mechanics problems. He submitted a full paper series containing his previous course projects and other projects. He briefly presents his work on Bioinspired structural design of composite materials and Fracture study of dentin microstructure and received positive comments from the audiences. Just gave a talk at SHU’s UG academic forum. Great experience! pic.twitter.com/5Vvz5dXRE5&mdash; Hanfeng Zhai (@HanfengZhai) December 30, 2020 -PRESENTATION-"},{"title":"Neural Network Method for Aeronautic Noise Prediction","date":"2020-08-31T16:00:00.000Z","updated":"2021-01-06T06:40:41.483Z","comments":false,"path":"AeroNN.html","permalink":"www.hanfengzhai.net/AeroNN.html","excerpt":"","text":"BackgroundToolsMethodsResultsReferences"}],"posts":[{"title":"HOME","slug":"index","date":"2019-11-29T16:00:00.000Z","updated":"2021-01-12T12:14:38.154Z","comments":true,"path":"2019/11/30/index/","link":"","permalink":"www.hanfengzhai.net/2019/11/30/index/","excerpt":"","text":"Welcome to Hanfeng Zhai's page! ________________________________________________________________ I am currently a Bachelor of Science student major in Theoretical and Applied Mechanics at the Department of Mechanics, SMES at Shanghai University. I’m currently working on neural network methods applied to aeronautic noise predictions, updates available in my notes. For more details, please visit my bio. Curriculum Vitae. Recent News ________________________________ Jan. 11th, 2020: Hanfeng gave a talk at the closing ceremony of the academic forum. See photos. News also covered by Tencent, SHU, Guangming Daily, Wenhui, etc. Dec. 30th, 2020: Hanfeng delivered a presentation at Shanghai University Undergraduate Academic Forum titled “Computation Methods for Applied Mechanics Problem“ (See my slides, paper, poster). The news are covered by Shanghai University and Baidu. See my Tweets and details. Dec. 7th, 2020: Hanfeng is nominated as Outstanding Student, see SMES News. Nov. 30th, 2020: Hanfeng receives the Shanghai University Academic Scholarship (Top Class) award (¥4000) and Shanghai University Arts and Sports Scholarship (¥500). See SHU News. Oct. 21st, 2020: Our poster for The Design of The Lightweight Compressive Interlayer displayed in the hall of SMES as outstanding undergraduate’s course design. See picture. Aug. 5th, 2020: Our poster for Design of Intelligent Tuning Equipment for Stringed Instruments is selected as backup poster of Shanghai University for National College Student Innovation Forum. See our poster. Feb. 30th, 2020: Hanfeng delivered a online course for the students of Department of Mechanics as a course project of Theory of Elasticity. Click for backup video. Oct. 28th, 2019: Our poster for The Design of The Lightweight Compressive Interlayer is displayed in the Virtural Simulation Lab at School of Mechanics and Engineering Science. See poster and photo.","categories":[],"tags":[]}],"categories":[],"tags":[]}