{"meta":{"title":"Hanfeng Zhai","subtitle":null,"description":null,"author":"Bachelor Student @ Shanghai University","url":"www.hanfengzhai.net","root":"/"},"pages":[{"title":"","date":"2019-11-29T16:00:00.000Z","updated":"2021-05-28T11:35:23.153Z","comments":true,"path":"about/index.html","permalink":"www.hanfengzhai.net/about/index.html","excerpt":"","text":"Bio Born and raised in Beijing, China, Hanfeng received his B.S. in Theoretical &amp; Applied Mechanics from Shanghai University, as Outstanding Graduate of Shanghai. He is a The Third Middle School of BNU ‘17 and RDFZ ‘14. In high school he won the Outstanding Speaker award in National High School Academic Debate. During middle school, he casts a short movie called Operation Empty Plate in 2013. He also played for the class team and won the RDFZ 2013 basketball competition championship. He grew up and recieved his primary education in Experimental Primary School of BNU, in which he started learning playing tuba, doing arts and playing magic tricks. Interested in fluid mechanics, deep learning, soft materials &amp; biomechanics, he conducted research on mechanical properties of enamel microstructure with Dongsheng Zhang &amp; Dwayne D. Arola from 2018 to 2020, during which they observe a specific band structure that proved to resist fracture verified through simulations. Later on, he worked with Guohui Hu on developing deep learning algorithms applied to microfluids, specifically on microbubble flows. He then developed BubbleNet. His previous undergraduate research projects can be viewed in his research. During his four years as a undergraduate, he played Denfensive End &amp; Linebacker at Bombers Football Team from 2017 to 2019 (Football Collection). And he has trained with Russell Wilson at RW3 Passing Academy in 2018 (Media coverage on AFInt). He has won the 1st and 3rd place at SHU bodybuilding contest in 2018 and 2019. He has experience in financial training at Bank of China Life at Hong Kong on Feburary 2018. In his spare time, he loves watching movies and hit the gym, and he also love history, philosophy, and social science. Education M.S. in Mechanical Engineering, Cornell University, incoming B.S. in Theoretical &amp; Applied Mechanics, Shanghai University, 2017 - 2021 If you have any difficulty with regards to the English content, feel free to visit the Chinese Version 中文版!"},{"title":"","date":"2020-10-28T02:35:55.551Z","updated":"2020-10-09T06:38:32.944Z","comments":false,"path":"categories/index.html","permalink":"www.hanfengzhai.net/categories/index.html","excerpt":"","text":"Code We have release the opensource code for mesoscopic simulations. NotePublications"},{"title":"","date":"2020-10-10T12:59:40.686Z","updated":"2020-10-09T02:16:54.476Z","comments":false,"path":"categories/news.html","permalink":"www.hanfengzhai.net/categories/news.html","excerpt":"","text":"ResearchLinks"},{"title":"Biomechanical composite material structural design","date":"2020-06-21T16:00:00.000Z","updated":"2020-10-07T06:36:33.906Z","comments":true,"path":"categories/code/CAD.html","permalink":"www.hanfengzhai.net/categories/code/CAD.html","excerpt":"AbstractBiomaterials like nacre and tooth enamel display spectacular mechanical properties such as high stiffness, high strength, high toughness, and fracture durability. Such properties are exhibited by their natural developed structures, both employ common characteristics: consisting of hard mineral inclusions and soft protein matrix. Here, we build models, representative, for nacre, and enamel consisting of hard inclusions and soft matrix, respectively.","text":"AbstractBiomaterials like nacre and tooth enamel display spectacular mechanical properties such as high stiffness, high strength, high toughness, and fracture durability. Such properties are exhibited by their natural developed structures, both employ common characteristics: consisting of hard mineral inclusions and soft protein matrix. Here, we build models, representative, for nacre, and enamel consisting of hard inclusions and soft matrix, respectively. We give the soft matrix a plastic property based on their natural mechanics. We thence calculate the 1 and 2-directional stiffness of the two structures and present their von Mises’ stress, directional stress, and directional strain distribution, respectively. For what is more, we estimate the fracture resistance of the two structures based on the assumption that the failure occurs on the soft matrix in which the shear stress reaches a critical value. We hence deduce that the nacre displays better 1-directional stiffness and enamel displays better 2-directional stiffness. The shear stress-displacement diagrams in each direction are also presented indicating the nacre is more likely to fail in 1-direction and enamel is more likely in 2-direction. Based on the results we present an optimized model taking the characters from both the nacre and enamel. Results show that the optimized model exhibits higher stiffness in both the two directions and evidently better crack resistance in 2-direction. Method Result Reference[1] B. An. Constitutive modeling the plastic deformation of bone-like materials. International Journal of Solids and Structures 92–93 (2016) 1–8[2] B. An, Y. Liu, D. Arola, D. Zhang. Fracture toughening mechanism of cortical bone: an experimental and numerical approach. J. Mech. Behav. Biomed. Mater., 4 (2011), pp. 983-992[3] An B., Zhang D. Bioinspired toughening mechanism: lesson from dentin. Bioinspir. Biomim., 10 (2015), Article 046010[4] B. An, H. D. Wagner. Role of microstructure on fracture of dentin. Journal of the Mechanical Behavior of Biomedical Materials. Vol 59 (2016): 527-537. ISSN 1751-6161.[5] M. Mirkhalafa, A. Sunesarab, B. Ashrafib, F. Barthelata. Toughness by segmentation: Fabrication, testing and micromechanics of architectured ceramic panels for impact applications. International Journal of Solids and Structures 158 (2019) 52–65[6] Godaa M. Assidib S. Belouettarb J.F. Ganghoffera. A micropolar anisotropic constitutive model of cancellous bone from discrete homogenization. J. Mech. Behav. Biomed. Mater., 2012; Vol 16: 87-108[7] Zhang Z., Zhang Y., Gao H. On optimal hierarchy of load-bearing biological materials. Proc. R. Soc. B, 278 (2011), pp. 519-525[8] Su Y, Wang L, Wu X, Yi C, Yang M, Yan D, Cheng K, Cheng X. The spatial differences in bone mineral density and hip structure between low-energy femoral neck and trochanteric fractures in elderly Chinese using quantitative computed tomography. Bone, Vol 12[9] B. Wang, X. Hub, P. Lua. Modelling and testing of large-scale masonry elements under three- T point bending – Tough and strong nacre-like structure enlarged by a factor of 20,000. Engineering Fracture Mechanics 229 (2020) 106961[10] Horacio, Decanini &amp; Juster, Allison &amp; Latourte, Félix &amp; Loh, Owen &amp; Grégoire, David &amp; Zavattieri, Pablo. (2011). Tablet-level origin of toughening in abalone shells and translation to synthetic composite materials. Nature communications. 2. 173. 10.1038/n[11] F Barthelat. Nacre from mollusk shells: a model for high-performance structural materials. Bioinsp. Biomim. 5 (2010) 035001 (8pp)[12] A. Ghazlana, T. Ngoa, T. Lea, T. Nguyena, A. Remennikov. Blast performance of a bio-mimetic panel based on the structure of nacre – A numerical study. Composite Structures 234 (2020) 111691.[13] A. Shi, Y. Li, W. Liu, J. Xu, D. Yan, J. Lei, Z. Li. Highly thermally conductive and mechanically robust composite of linear ultrahigh molecular weight polyethylene and boron nitride via constructing nacre-like structure. Composites Science and Technology[14] D. Bajaj, D. Arola. Role of prism decussation on fatigue crack growth and fracture of human enamel. Acta Biomaterialia 5 (2009) 3045–3056.[15] M. Yahyazadehfar, D. Bajaj, D. Arola. Hidden contributions of the enamel rods on the fracture resistance of human teeth. Acta Biomaterialia 9 (2013) 4806–4814[16] M. Yahyazadehfar, D. Arola. The role of organic proteins on the crack growth resistance of human enamel. Acta Biomaterialia 19 (2015) 33–45.[17] N. Zhang, X. Wang, W. Xiang, Y. Zhong, F. Yana, B. Jiang. Hierarchy structure and fracture mechanisms of the wild wolf tusk’s enamel. Materials Science &amp; Engineering C 106 (2020) 110277.[18] J. Koldehoff, M. V. Swain, G. A. Schneider. The geometrical structure of interfaces in dental enamel: A FIB-STEM investigation. Acta Biomaterialia 104 (2020) 17–27."},{"title":"","date":"2020-10-15T12:34:12.451Z","updated":"2020-10-01T04:53:42.929Z","comments":true,"path":"note/cfd/1.html","permalink":"www.hanfengzhai.net/note/cfd/1.html","excerpt":"","text":"CFD .line-limit-length { display: -webkit-box; -webkit-box-orient: vertical; -webkit-line-clamp: 2; word-break: break-all; overflow: hidden; } .content { word-break: break-all; word-wrap: break-word; } 1/9 您的浏览器不支持 audio 标签2/9 3/9 4/9 5/9 6/9 7/9 8/9 9/9出口成章，跃然纸上Powered by iFlytek /* window.onload = function(){ alert(\"接有关部门通知，暂时停止北京鲁谷机房的多媒体文件共享服务（云端部署服务器所在地），预计五月初可以恢复，给您带来的不便，敬请谅解。\"); } */ var wxData=new WxData(); chatJSON = $('#wchattext').val(); var realDesc=\"\"; // if(chatJSON.length>2){ // jsobj = JSON.parse(chatJSON); // for(i=0;i35){ // realDesc=realDesc.substr(0,35); // realDesc+=\"...\"; // break; // }else{ // realDesc += substr; // } // } // } wxData.get_all_token(window.location.href); function confirmEnding(str, target) { // 请把你的代码写在这里 var start = str.length-target.length; var arr = str.substr(start,target.length); if(arr == target){ return true; } } videoImgUrl=$(\"#wchatVideoPreview\").val(); // alert(videoImgUrl); if(confirmEnding(videoImgUrl, '/')){ videoImgUrl=videoImgUrl.substring(0,videoImgUrl.lastIndexOf('/')) } //alert(videoImgUrl); wxData.populate(videoImgUrl,$(\"#wchatWeikeName\").val(),realDesc); function hiddenTip(){ $(\".sxb-top-tips\").hide(); } function weixinImgClick() { var imgsurl = []; var nowurl = ''; var imgObj = $(\".imgView\"); for (var i = 0; i < imgObj.length; i++) { imgsurl[i] = imgObj[i].src; console.log(imgObj[i].src); nowurl=imgObj[i].src; // imgObj[i].onclick = function() { // nowurl = this.src; // console.log(1); // wx.previewImage({ // current : nowurl, // urls : imgsurl // }); // } $(\"#handimg\"+i).click (function() { wx.previewImage({ current : nowurl, urls : imgsurl }); }); } } function weixinClick(nowSrc){ var imgsurl = []; var nowurl = ''; var imgObj = $(\".imgView\"); for (var i = 0; i < imgObj.length; i++) { imgsurl[i] = imgObj[i].src; } wx.previewImage({ current : nowSrc, urls : imgsurl }); }; $(function() { var rootPath = getRootPath(); //点击穿透解决方案 FastClick.attach(document.body); var noteId = \"\"; noteId = '97d201c1f1c04a9b926e230a702f0b23'; var u = navigator.userAgent; var isAndroid = u.indexOf('Android') > -1 || u.indexOf('Adr') > -1; //android终端 var isiOS = !!u.match(/\\(i[^;]+;( U;)? CPU.+Mac OS X/); //ios终端 var os = \"android\"; if (isiOS) { os = \"ios\"; } $.ajax({ url : rootPath + '/noteShareHtml.action', type : 'POST', async : false, dataType : 'html', data : { shareId : noteId, osType : os }, success : function(result) { // $('#share_detail').html(result); var need = result.indexOf(\"needRefresh\")>-1; if(need){ setTimeout(function(){ //使用 setTimeout（）方法设定定时2000毫秒 window.location.reload();//页面刷新 },30000); } $('#share_detail').append(result); if (isiOS) { audios = $('.audio').audioPlayer(); // $('.audioplayer').each(function(){ // var thisPlayer = this; // $(this).find('.audioplayer-playpause').on('click',function(){ // myaudio = audios[0]; // myaudio.pause(); // }) // }); return; } var audios = document.getElementsByTagName(\"audio\"); // 暂停函数 function pauseAll() { var self = this; [].forEach.call(audios, function (i) { // 将audios中其他的audio全部暂停 i !== self && i.pause(); }) } // 给play事件绑定暂停函数 [].forEach.call(audios, function (i) { i.addEventListener(\"play\", pauseAll.bind(i)); }) // weixinImgClick(); }, error : function() { } }); // setTimeout(function() { // var myScroll = new BScroll('.sxb-scroll', { // scrollbar : { // fade : true, // interactive : false // // 1.8.0 新增 // } // }); // }, 2000); });"},{"title":"","date":"2020-12-08T09:52:39.373Z","updated":"2020-12-08T09:52:39.373Z","comments":true,"path":"about/template.html","permalink":"www.hanfengzhai.net/about/template.html","excerpt":"","text":"Presentation for thermal estimation of smartphone chip Click for presentation file. Click for the course paper."},{"title":"Forum Presentation","date":"2020-12-29T16:00:00.000Z","updated":"2020-12-31T05:39:15.594Z","comments":false,"path":"categories/UAF_2020.html","permalink":"www.hanfengzhai.net/categories/UAF_2020.html","excerpt":"","text":"Shanghai University Undergraduate Academic Forum The Shanghai University Undergraduate Academic Forum is a forum initiated by Shanghai University to inspire prospective undergraduate students to present their research works and further idea exchange. Hanfeng delivered a presentation titled “Computation Methods for Applied Mechanics Problem” covering his previous works on applying simulation and analytical mathematical analysis to tackle both solid and fluid mechanics problems. He submitted a full paper series containing his previous course projects and other projects. He briefly presents his work on Bioinspired structural design of composite materials and Fracture study of dentin microstructure and received positive comments from the audiences. Just gave a talk at SHU’s UG academic forum. Great experience! pic.twitter.com/5Vvz5dXRE5&mdash; Hanfeng Zhai (@HanfengZhai) December 30, 2020 -PRESENTATION-"},{"title":"Forum Presentation","date":"2021-01-10T16:00:00.000Z","updated":"2021-01-12T12:30:54.746Z","comments":false,"path":"categories/UGAF_Talk.html","permalink":"www.hanfengzhai.net/categories/UGAF_Talk.html","excerpt":"","text":"My first talk in 2021. Ngl it’s hard to hide your nervousness in front of such a huge crowd :) pic.twitter.com/0rp8Xwsuot&mdash; Hanfeng Zhai (@HanfengZhai) January 11, 2021"},{"title":"","date":"2021-04-20T12:30:16.714Z","updated":"2021-04-20T12:30:16.714Z","comments":false,"path":"cn.html","permalink":"www.hanfengzhai.net/cn.html","excerpt":"","text":"欢迎来到我的个人主页! 个人简介 翟晗锋，目前在就读于上海大学，理论与应用力学专业. 查看我的完整介绍. 我目前正在研究基于物理深度学习的微流体多相流预测用以毕业设计, 在我的笔记也可以看到近期进展和更新. 本科期间主要工作集中在固体生物能源材料的疲劳、破坏等基本力学性能；以及微流体中的深度学习算法. 主要在胡国辉教授课题组工作. 相关报告&amp;论文在我以往的研究中可见. 英文简历. 教育背景 康奈尔大学 - 机械工程研究型硕士，2021起 上海大学 - 理论与应用力学理学学士，2017 - 2021 近期新闻 2021年4月20日: 我在郭战胜教授课题组简概深度学习在力学中的应用. 2021年2月23日: 我在寒假期间以写手为量子位撰写科学宣传文章. 参考(1, 2, 3, 4, 5). 2020年1月11日: 我在本科生学术论坛闭幕式上发表本科生学术研究的演讲. 中国工程院院士孙晋良也出席了仪式. 点击查看图片. 相关新闻也被上海教育电视台, 腾讯, 上海大学, 光明日报, 文汇报等报道. 2020年12月30日: 我在上海大学第三届本科生学术论坛发表名为应用力学的计算方法的演讲 (查看演讲稿, 论文, 海报). 相关新闻查看上海大学新闻网和百度新闻. 详情请查看英文简介. 2020年12月7日: 我被命名为优秀学生, 名单请看力学工程科学学院官网. 2020年11月30日: 我收到了上海大学特等学业奖学金(4000元)和上海大学文艺体育奖学金(500元). 名单详情查看上海大学. 2020年10月21日: 我们对于轻量化层间结构设计的海报被展示在力学与工程科学学院用以本科生优秀课程设计展示. 查看图片. 2020年8月5日: 我们对于智能调音设备被选为上海大学的备选海报用以参加国家大学生创新创业论坛. 查看海报. 2020年2月30日: 我给上海大学力学系的同学讲述了关于薄板屈曲理论的课程用以弹性力学的课程项目. 点击查看备份视频. 2019年10月28日: 我们对于轻量化层间结构设计的课程设计海报在力学与工程科学学院虚拟仿真实验室被展示. 查看相关海报和图片. 科研 &amp; 学术查看关于我的完整学术内容，请查看我的研究以及笔记. 注：中文版界面可能会更新不及时，内容以英文版为主！"},{"title":"","date":"2021-01-21T12:49:16.329Z","updated":"2021-01-21T12:49:16.329Z","comments":true,"path":"2021-01-21.html","permalink":"www.hanfengzhai.net/2021-01-21.html","excerpt":"","text":"洛桑联邦理工华人科学家最新进展登上Nature: 直接对材料结构进行“编程”就在昨天，一篇最新的Nature研究向我们展示了可以通过直接对材料的结构单元加力实现数据的储存，打破了硬件装置和存储终端存在的界限。 熟悉计算机编程的朋友应该对计算机硬盘的存储方式不陌生：硬盘的数据都保存在盘片上，盘片上布满了磁性物质。我们都知道磁性有南、北两级，正好可以表示二进制的0和1，我们给它加电流让磁针在0和1之间转换完成逻数据储存。 这篇刊登在Nature上的研究展示了原来材料也可以进行“编程”。材料结构由众多的材料基本单元组成，这些单元可以类比于计算机硬盘中的电磁比特，作者们在此称这些单元为“机械比特”，由力加在这些“机械比特”上让他们产生0和1的转换。这些机械比特以空间排列构成了一种自关联材料 (Metamaterial)。 这些“机械比特”是由聚合物制成的基本单元，由一个绿色的柔性外壳，内含一个紫色的可上下移动的电磁接收传输装置，在这里，作者称他为“开关”。 对这些单元进行电磁信号和机械信号的刺激并加力（信号），这个开关实现了两个物理状态之间的转换；就好比我们对真正的电磁比特施加电信号，可以理解为我们“编程”的过程。 这个开关的上下移动一次，实现了状态的改变，就可以理解为电磁比特之间实现了一次0和1的逻辑运算。 而如何实现开关的转变呢？在这里，作者通过施加机械载荷使得开关完成了两个状态的改变可以类比于电信号使得电磁比特完成了0到1的逻辑转换，这里，作者通过力学信号完成了开关两个不同态转换，也可以看作是完成了一次逻辑运算。 而因为存在着紫色的电磁信号接收器，我们先前给材料施加的力学信号的命令可以被计算机识别出来，因此通过对材料扫描和识别我们便实现了数据的储存。 就好像是我们通过输入了代码进行运行后通过比特单位之间的电磁信号传输实现不同功能一样，我们给这些“机械比特”单位输入不同的命令也能让整体材料实现不同功能。真是万物皆可“编程”。 在论文中，作者们也介绍了他们开展这个研究的思路。在传统的材料学设计中，人们习惯将材料分成无数个细微的单元 (Unit Cell)，通过对单元进行设计再整体对单元进行空间排列既可以实现不同的材料性质。 相似的思路也被借鉴到这个研究中。然而，传统的材料性能设计一般仅仅局限于改变材料的泊松比，性状改变等。只不过在这里，作者们突发奇想，直接用材料实现了记忆存储。 实际存在的物理实体总是需要通过传感器和命令终端链接，就好比我们的身体要通过神经接受大脑传输的信号一样，计算机也是如此。这层无形中的界限使得信息储存和实体控制之间总是存在延迟。而这篇研究最重要的意义，就是打破了这层界限。 论文一作是一位来自加拿大的华人小哥Tian Chen，其本科毕业于多伦多大学，硕士毕业于代尔夫特理工，博士又在苏黎世理工开展研究。后又到加州理工进行访问工作。现于洛桑联邦理工开展他的研究。其教育背景彰显妥妥的“国际范”。 值得一题的是，他本科学习“工程科学”，硕士又转入土木工程，博士学位是机械工程，是“越学越专”的典型。 目前他在博士后期间研究的题目是“发现外骨骼设备的力学不稳定性”(Exploring Mechanical Instability for Assistive Exoskeletal Devices)。想必这篇优秀的研究也是他博士后期间长远布局的一部分吧。 目前他所在的实验室“灵活结构设计实验室”也是在智能仿生材料和结构设计领域大名鼎鼎的实验室之一。实验室设计的领域相对较广，涉及固体、流体力学、材料断裂与破坏等等。但总体来说以软材料和仿生材料为主。 不过，这次的他们的研究也许可以给更多领域带来福音。 参考链接[1] https://www.nature.com/articles/d41586-021-00080-5 [2] https://www.nature.com/articles/s41586-020-03123-5#additional-information [3] https://arstechnica.com/science/2021/01/new-metamaterial-merges-magnetic-memory-and-physical-changes/"},{"title":"","date":"2020-12-27T16:00:00.000Z","updated":"2021-02-06T07:16:37.469Z","comments":true,"path":"bio.html","permalink":"www.hanfengzhai.net/bio.html","excerpt":"","text":"BIO Born and raised in Beijing, China, I am an undergraduate student currently studying at Shanghai University in Shanghai. I went to Beijing No.12 High School for high school and High School Affiliated to Renmin University of China for middle school. I grew up and recieved my primary education in Experimental Primary School of Beijing Normal University, in which I started learning playing tuba and doing arts. Enthusiastic about both solid and fluid mechanics, I’ve engaged in research projects ranging from the designing of bio-inspired hierarchical materials with superior mechanical properties to numerical studies and algorithms of fluid mechanics problems. I’m passionate on learning the most cutting-edge knowledge and exploring the world of mechanics. My previous undergraduate research projects can be viewed in my projects. Main Research Interests ________________________________________________________ Computational fluid dynamics and numerical methods Machine learning algorithms for fluid dynamics Microscopic and nanoscopic mechanical phenomena Extracurricular Activities _______________________________________________________ As a mechanics student, I am also a student having a wide range of interests. I am a zealot of sport. I was the Defensive End and Linebacker at Shanghai University Football Team (Bombers). And I also got the privilige to meet Russell Wilson (Media coverage on AFInt) and training with him in Shanghai. I have won the 1st and 3rd place in the school’s bodybuilding contest in 2018 and 2019. I have experience in financial training at Bank of China Life at Hong Kong on Feburary 2018. I also love painting, arts, and all sorts of things that can excites me. In my spare time, I love watching movies and do sports, and I also love history, philosophy, and social science."},{"title":"NOTES","date":"2019-11-29T16:00:00.000Z","updated":"2021-04-27T13:28:52.011Z","comments":false,"path":"note.html","permalink":"www.hanfengzhai.net/note.html","excerpt":"","text":"Seminars _________________________ Neural Network on Multiscale Fluid Dynamics Predictions. Supervised by Guohui Hu. 4/26/2021: A short intro &amp; review of Weinan E‘s works. [PDF] 4/20/2021: A brief introduction of deep learningalgorithms applied to mechanics, seminar at Zhansheng Guo‘s lab. [PDF] 4/12/2021: Training &amp; prediction results of BubbleNet &amp; deep neural nets. [PDF] 3/22/2021: Physics-Informed neural network for microbubble dynamics. [PDF] 1/15/2021: Project plan for thesis (in Chinese). [PDF] 12/7/2020: Progress update on neural network predictions on acoustic pressure field. [PDF] 12/21/2020: Paper review of Fourier Neural Operator for Parametric Partial Differential Equations. [PDF] Biomechanics Research on Enamel Microstructure. Supervised by Dongsheng Zhang &amp; Dwayne D. Arola. Observation on enamel’s decussation bands. [PDF] Modelling on enamel’s structure in 3D. [PDF] Progress on the new observations and simulations. [PDF] New observations and strategies for structural modeling. [PDF] New observations and measurements for modeling. [PDF] Parameters measurements for microstructural modeling. [PDF] Reports for update on 3D printing on modeling. [PDF] Learning Notes ___________________________________ Computational Fluid Dynamics. Taught by Xiaoquan Yang. SHU 01826063 (2020). 1. Introduction to CFD. [PDF] 2. Nondimensionalization. [PDF] 3. Finite Volume Method. [PDF] 4. Finite Difference Method. [PDF] 5. Boundary Conditions. [PDF] 6. Artificial Dissipation. [PDF] 7. Meshing Transformation &amp; Viscosity Discretization. [PDF] 8. Implicit Difference Scheme. [PDF] Navier-Stokes Equation. [PDF] Smoothed-Particles Hydrodynamics. [Slides] | [BiliBili] | [YouTube] Finite Volume Method &amp; Shock Tube Problem. [Slides] | [BiliBili] | [YouTube] Mathematical Model of Neural Network. [PDF] Buckling of a Thin Plate. [Slides] | [BiliBili]"},{"title":"PUBLICATIONS","date":"2019-11-29T16:00:00.000Z","updated":"2021-03-14T03:57:58.688Z","comments":false,"path":"publications.html","permalink":"www.hanfengzhai.net/publications.html","excerpt":"","text":"S. Liu, H. Zhai, Y. Xu, B. An*, D. Zhang*. The Role of Rod Decussation on Crack Deflection in Enamel, submitted."},{"title":"RESEARCH","date":"2019-11-29T16:00:00.000Z","updated":"2021-06-02T11:48:48.287Z","comments":false,"path":"research.html","permalink":"www.hanfengzhai.net/research.html","excerpt":"","text":"Undergraduate Projects ______________________________________________________ Research Projects H. Zhai. Inferring Microbubble Dynamics with Physics-Informed Deep Learning. Undergraduate Thesis Project (2021). Supervisor: Prof. Guohui Hu. S. Liu, H. Zhai, et al. Biomechanics Research on Enamel Microstructure. National Natural Science Foundation of China (2019). Principle: Profs. Dongsheng Zhang &amp; Dwayne D. Arola. Course Projects H. Zhai. Structural design of composite materials with superior mechanical behaviors: lesson from the microstructure of nacre and enamel. CAD Application in Structural Mechanics (2020). Supervisor: Prof. Bingbing An. [PDF] H. Zhai. Formulation and application of rate-independent stress update algorithm of hydrostatic pressure: elastoplastic yielding in composite. Plasticity Theory (2020). Supervisor: Prof. Bingbing An. [PDF] H. Zhai. Investigation of the mechanics of the airfoil: application of machine learning in the noise prediction of NACA 0012. Research methods (Fluid Physics on Flight) (2020). Supervisor: Profs. Yuhong Dong &amp; Xiaoquan Yang. [PDF] H. Zhai, S. Weng, B. Liang, C. Tang, Z. Wang. Structural Design of Lightweight Compressive Interlayer (in Chinese). Finite Element and Its Applications (2019). Supervisor: Prof. Yicheng Song. [Poster] H. Zhai. The FEM Simulation and Estimation of the Library of Shanghai University &amp; The Simulation and Estimation of the Fracture of Taiwan’s Nanfang’ao Bridge (in Chinese). Finite Element and Its Applications (2019). Supervisor: Prof. Yicheng Song. [PDF] H. Zhai, H. Wen, W. Xie. The curve fitting of the tension and frequency of the Guitar string vibration (in Chinese). Experimental Mechanics (2019). Supervisor: Prof. Kai Li. [PDF] H. Zhai. Linear Regression on Concrete Compressive Strength (in Chinese). Machine Learning and Mechanics (2019). Supervisor: Prof. Guohui Hu. [PDF] H. Zhai. Decision Tree Estimation on Frigate Propulsion Velocity (in Chinese). Machine Learning and Mechanics (2019). Supervisor: Prof. Guohui Hu. [PDF] H. Zhai. Naïve Bayes classification calculation on Yacht Hydrodynamics Data Set (in Chinese). Machine Learning and Mechanics (2019). Supervisor: Prof. Guohui Hu. [PDF] H. Zhai. Thermal Estimation of Smartphone Chipset: Mechanical Distribution of Chipset in Multiphysics Field. Elastic Mechanics (2019). Supervisor: Prof. Junqian Zhang. [PDF] | [Slides] | [Video] Training Programs H. Zhai, S. Diao, S. Weng. Design of Intelligent Tuning Equipment for Stringed Instruments. National College Student Innovation and Entrepreneurship Project (2019-2020). Supervisor: Prof. Kai Li. {#201910280001}. [Report] | [Poster] H. Zhai, K. Wang, Z. Liu. An optimized algorithm for the prediction of the water emptying time on BPNN. UC Berkeley Online Research Program (2020). Supervisor: Prof. Reza Alam. [PDF] | [Slides] | [Code] | [Video] H. Zhai. An investigation of the elastoplastic nature of ITD on the toughness of the dentin microstructure. SHU Summer Research Program (2020). Supervisor: Prof. Bingbing An. [PDF] H. Zhai, S. Weng. Beam force calculation GUI development (MATLAB). SHU Summer Research Program (2019). Supervisor: Prof. Yongqi Ma. [Code]"},{"title":"SOFTWARES","date":"2019-11-29T16:00:00.000Z","updated":"2021-05-13T10:21:37.165Z","comments":false,"path":"software.html","permalink":"www.hanfengzhai.net/software.html","excerpt":"","text":"BubbleNetA deep learning framework for inferring bubble dynamics with physics-informed neural network BubbleNet is a deep learning framework designed for predict and obtain the physics of micro-bubble dynamics based on the general structure of PINN. Bubble dynamics are widely observed and applied to biophysics, chemical engineering, medical engineering, and various engineering disciplines. The BubbleNet architecture achieves higher accuracy with less iterations compared with traditional DNNs. The code can be downloaded through GitHub."},{"title":"Predicting microbubble dynamics with physics-informed deep learning","date":"2020-08-31T16:00:00.000Z","updated":"2021-05-01T05:29:04.075Z","comments":false,"path":"BS_Thesis.html","permalink":"www.hanfengzhai.net/BS_Thesis.html","excerpt":"","text":"Supervisor: Guohui Hu $^1$Department of Mechanics, $^2$Shanghai Institute of Applied Mathematics and Mechanics,School of Mechanics and Engineering Science,Shanghai University [Project Plan (Chinese)] | [Thesis (Chinese)] Background Methods Results References"},{"title":"H.Z. Art Gallery","date":"2021-04-19T06:39:46.388Z","updated":"2021-04-19T06:39:46.388Z","comments":false,"path":"Art.html","permalink":"www.hanfengzhai.net/Art.html","excerpt":"","text":"翟晗锋画廊This gallery contains some of the art &amp; paintings that Hanfeng did before. Welcome and Enjoy!"},{"title":"H.Z. Football Collection","date":"2021-04-19T06:19:08.554Z","updated":"2021-04-19T06:19:08.554Z","comments":false,"path":"football.html","permalink":"www.hanfengzhai.net/football.html","excerpt":"","text":"Game Collections Training &amp; Drills"},{"title":"","date":"2021-05-01T05:31:26.450Z","updated":"2021-05-01T05:31:26.450Z","comments":false,"path":"翟晗锋.html","permalink":"www.hanfengzhai.net/%E7%BF%9F%E6%99%97%E9%94%8B.html","excerpt":"","text":"个人介绍 翟晗锋，男，北京市人，本科就读于上海大学，理论与应用力学专业。17年毕业于北师大三附中，14年毕业于人大附中。高中期间于全国高中生辩论大赛获得最佳辩手称号。中学期间, 他于2013年主演光盘行动电影。 他同时参与人大附中2013年篮球赛，其班级赢得该年冠军。11年毕业于北师大实验小学，期间担任管乐团大号首席，学习美术，热衷魔术。 他目前主要研究兴趣在流体力学，深度学习，软材料以及生物力学。他曾在2018-2020年于张东升教授以及华盛顿大学的Dwayne D. Arola教授实验室从事牙釉质微观结构力学性质研究；期间他们观察到了一种特殊的交错扭转结构可以用模拟仿真验证有效抑制裂纹扩展。之后，他又在胡国辉教授课题组从事微流体中的深度学习算法研究，侧重于预测微气泡流动。本科期间多次以组长身份带领小组在不同力学领域完成优秀课程设计。他本科期间成果均在研究可见。 在他四年本科期间，他曾与2017至2019年效力于上海大学爆破者橄榄球队 担任截锋和线卫 (橄榄球集锦)。他曾在2018年与拉塞尔·威尔逊在威尔逊训练营一同训练 (橄榄球国际予以报道)。他曾于2018和2019年在上海大学健美比赛中分别获健美组第1、3名。他曾于2018年2月在香港中银人寿 接受金融方面的训练。闲暇时间中，他酷爱电影、健身；他同时热衷于历史、哲学、社会政治学等。 注：中文版界面可能会更新不及时，内容以英文版为主！ 英文介绍"},{"title":"","date":"2021-04-20T04:47:03.349Z","updated":"2021-04-20T04:47:03.349Z","comments":true,"path":"项目中文版.html","permalink":"www.hanfengzhai.net/%E9%A1%B9%E7%9B%AE%E4%B8%AD%E6%96%87%E7%89%88.html","excerpt":"","text":"科研项目 S. Liu, H. Zhai, et al. Biomechanics Research. 中国国家自然科学基金 (2019). 负责人: 张东升 &amp; Dwayne D. Arola教授. 课程项目 H. Zhai. Structural design of composite materials with superior mechanical behaviors: lesson from the microstructure of nacre and enamel. CAD在结构力学中的应用 (2020). 指导教师: 安兵兵. [PDF] H. Zhai. Formulation and application of rate-independent stress update algorithm of hydrostatic pressure: elastoplastic yielding in composite. 塑性力学 (2020). 指导教师: 安兵兵. [PDF] H. Zhai. Investigation of the mechanics of the airfoil: application of machine learning in the noise prediction of NACA 0012. 飞行奥秘与流动物理 (2020). 指导教师: 董宇红 &amp; 杨小权. [PDF] 翟晗锋, 翁聖劼, 梁浜, 汤诚智, 王子安. 轻量化结构设计. 有限元及其应用 (2019). 指导教师: 宋亦诚. [海报] 翟晗锋. 对上海大学图书馆承风和台湾南方澳大桥破坏的仿真模拟分析. 有限元及其应用 (2019). 指导教师: 宋亦诚. [PDF] 翟晗锋, 文海舟, 谢文韬. 吉他弦张力频率曲线拟合分析. 实验力学 (2019). 指导教师: 李凯. [PDF] 翟晗锋. 混凝土抗压强度线性模型 . 机器学习与力学 (2019). 指导教师: 胡国辉. [PDF] 翟晗锋. 护卫舰推进设备速度评估决策树 . 机器学习与力学 (2019). 指导教师: 胡国辉. [PDF] 翟晗锋. 快艇水动力参数朴素贝叶斯概率计算 . 机器学习与力学 (2019). 指导教师: 胡国辉. [PDF] H. Zhai. Thermal Estimation of Smartphone Chipset: Mechanical Distribution of Chipset in Multiphysics Field. 弹性力学 (2019). 指导教师: 张俊乾. [PDF] | [演讲稿] 训练实习 翟晗锋, 刁山洲, 翁聖劼. 智能调音设备的设计与探究. 国家级大学生创新创业项目 (2019-2020). 指导教师: 李凯. {#201910280001}. [报告] | [海报] H. Zhai, K. Wang, Z. Liu. An optimized algorithm for the prediction of the water emptying time on BPNN. UC Berkeley Online Research Program (2020). 指导教师: Reza Alam. [PDF] | [演讲稿] | [代码] H. Zhai. An investigation of the elastoplastic nature of ITD on the toughness of the dentin microstructure. 上海大学夏季学期科研实习 (2020). 指导教师: 安兵兵. [PDF] 翟晗锋, 翁聖劼. 梁结构力学计算用户界面 (MATLAB). 上海大学夏季学期计算机实习 (2019). 指导教师: 马永其. [代码]"},{"title":"","date":"2019-11-29T16:00:00.000Z","updated":"2021-05-20T10:25:13.479Z","comments":true,"path":"BubbleNet.html","permalink":"www.hanfengzhai.net/BubbleNet.html","excerpt":"","text":"BubbleNetA deep learning framework for inferring microbubble dynamics Hanfeng Zhai &amp; Guohui Hu [Code] | [Paper] | [Video] Backgrounds &amp; IntroductionMachine learning (ML) has achieved tremendous success in the last decade due to the availability of big data and computer resources. The success of AlphaGo burst the public’s interest by showing the huge potential of machine learning and artificial intelligence. The ML techniques shows promising results, specifically in medicine, e.g., AlphaFold for discovering protein structures, COVID-19 detections, etc. both are becoming more significant in our aging societies. Deep neural networks (DNNs), as one of the most prominent tools of ML, have been adopted to tackle various physics problems including turbulence, flow control, heat transfer, and combustion. These deep learning applications have grown drastically in recent years, mainly on learning physical equations and inferring dynamics. Numerous novel frameworks has henceforth been proposed: SINDy and PDE-FIND, using sparse regression to identify the governing equations for nonlinear dynamic systems; Graph Kernel Network, Fourier Neural Operator and MeshfreeFlowNet, using convolutional neural networks to learn image mapping the physics fields; Deep potential, DeePMD and DeePCG, using deep neural nets to map the molecular potentials at the microscale. In 2018, Raissi et al. proposed a deep learning framework called physics-informed neural networks (PINNs) for identifying and inferring dynamics of physical systems governed by partial differential equations (PDEs). The strategy of PINN can be simplified as embed governing PDEs into the loss function as a soft physics constraint, namely the ‘physics-informed’ part. Based on PINN, Lu et al. then proposed DeepXDE and DeepONet, the refined versions of PINNs, for learning and inferring nonlinear operators of PDEs. The PINN series has been developed to solve numerous problems, including Fractional PINNs for predicting fractional PDEs; Conservative PINNs for nonlinear conservation laws; Extended PINNs, a PINN approach for space-time domain decomposition; Parareal PINNs, a PINN solver decomposing a long-time problem into many independent short-time problems supervised by an inexpensive/fast coarse-grained (CG) solver; and many related PINNs. Besides, PINNs has achieved great success for predicting laminar flows and high speed flows, heat transfer and turbulence. Bubbly flows is a classic fluid mechanics problem, specifically at the mesoscale. The bubble pinch-off effect confined in microtube is one of the most studied problems in fluid mechanics (Dollet et al., Herrada et al., van Hoeve et al., Vega et al., Zhao et al.), depicting deformation and movement of single bubble dynamics. Single bubble movement has also been studied for investigating blood-brain barrier (Miao et al., Hosseinkhah et al., Hosseinkhah et al.). Bubbly flow with multiple bubbles displays complexity due to the interactions between bubbles (Talu et al., Tenjimbayashi et al.), which are also widely studied for drug delivery (Papadopoulou et al., Peyman et al.). Acknowledging the importance and numerous applications of bubbly flow, and realizing the powerful tool of physics based machine learning, we here apply machine learning to infer and predict the bubbly flow. Our work is inspired by Raissi et al. and Lin et al. using physics-informed deep learning to infer bubble dynamics. Different from Lin et al.‘s approach, we do not adopt the theoretical model optimized for modeling bubble (i.e., the Rayleigh-Plesset equation). Instead, we directly compute how bubble moves through numerical simulations of multiphase flow. Based on PINNs, we also propose a new deep learning architecture, called BubbleNet, which entails three main parts: deep neural networks (DNN) with sub nets for predicting different physics fields; the physics-informed part, with the fluid continuum condition encoded within; the time discretized normalizer (TDN), an algorithm to normalize field data per time step before training. We apply the traditional DNN and our BubbleNet to train the simulation data and predict the physics fields of both the two bubbly flow cases. Methods &amp; ResultsTwo cases were set up for investigating the bubble flow: $^1$ single bubble flow and $^2$ multiple bubbles flow, confined in a microtube. For the single bubble case: the microbubble diameter is set to be $d = 4\\mu \\rm m$; the micro-tube has a length of 15$\\mu$m and diameter of $5\\mu \\rm m$; we set up periodic boundary conditions (BCs) as $\\Delta p = 10 \\rm Pa$, and the tube is confined at the end as constant pressure $p = 799.932 \\rm Pa$ (6mmHg), corresponding to the pressure in human interstitial fluid. the initial conditions (ICs) is set as the pressure $p_0 = 799.932Pa$, with room temperature as $293.15K$. For the multiple bubbles flow: 60 micro-bubbles are randomly distributed in a 2D micro-tube with a length of $100\\mu \\rm m$ and a diameter of $50 \\mu \\rm m$, with each micro-bubble of the diameter of $3\\mu \\rm m$. The BCs and ICs are same with the single bubble case: $ \\Delta p = 10 \\rm Pa$, constant pressure at tube end $p = 799.932 \\rm Pa$ and $p_0 = 799.932 \\rm Pa$, with room temperature as $293.15K$. Both the meshing of the two bubbly flows are set to be extremely fine. For a single bubble case, the simulation is run for $5000 \\mu \\rm s$, and for the multiple bubbles case, the simulation is run for $3000 \\mu \\rm s$. Simulation for the single bubble flow case. Simulation for the multiple bubbles flow case. The basic structure of BubbleNet is shown in the following figure, as introduced previously. Where we differenciate the latent function $\\psi$ to compute the velocities $u$ and $v$: $u = {\\partial \\psi \\over \\partial y},\\ v = - {\\partial \\psi \\over \\partial x}$ We use the mean square error (MSE) for computing the loss function: $L = MSE\\left( u_{pred} - u_{train} + v_{pred} - v_{train} + … + \\phi_{pred} - \\phi_{train}\\right)$ We used traditional deep neural network and our BubbleNet to predict the physics fields $u,\\ v,\\ p,\\ \\phi$, of bubbly flow. Here, we show the level set phase function $\\phi$ prediction for both the bubbly flow of a single bubble and multiple bubbles are shown in the following figures, at $2000 \\mu \\rm s$ for the single bubble case and $1500 \\mu \\rm s$ for the single bubble case. Training for 10000 iterations for the single bubble case and 200000 iterations for the multiple bubbles case. Adopting the Adam optimizer and ‘L-BFGS-B’ optimization method. TutorialBubbleNet is a deep learning package building on top of TensorFlow, install tf before using BubbleNet: 1pip install tensorflow To use BubbleNet, you first need to download the code through GitHub (on your customized directory): 1git clone https://github.com/hanfengzhai/BubbleNet.git In our practice, we trained our NNs on Beijing Super Cloud Computing Center, (BLSC). We therefore offer bash files can be runned on both BLSC or your lab work station. Here, you can try out the single bubble case and train both the DNN and BubbleNet: I. For BLSC users, please run 1sbatch runSingleBubble_SuperComputing.sh II. If you are using the work station at your lab or home: 1bash runSingleBubble_WorkStation.sh III. Or just execute the py files directly: 12python bubble_DNN.py # run it on traditional deep neural netpython bubble_PhysNet.py # run it on BubbleNet Similarly, training the bubbly flow with multiple bubbles case on NN, run: 1sbatch runMultiBubble_SuperComputing.sh # for BLSC users 1bash runMultiBubble_WorkStation.sh # customized for workstations 123# directly execute the python filespython bubblesys_DNN.py # run it on traditional deep neural netpython bubblesys_PhysNet.py # run it on BubbleNet After the training, you will see the losses callbacks on your command lines, &amp; the accuracy for the NNs. You will also see the saved files of both the DNN &amp; BubbleNet predictions in your directory. Open these ‘.txt‘ files with matlab and convert them into ‘.mat‘ numerical matrix files. Then, execute the ‘.m‘ files to generate figures for the final results, either with MATLAB or Octave: 12octave figure_preparation.m octave figure_generation.m Now, sort out all the figures and you’ve already utilize most of BubbleNet! :) Tech DetailsIf you are a developer wishing to customize your own BubbleNet for predictions, please refer the simplified version of our DNN and BubbleNet algorithms: I. for DNN, the algorithms can be simplified to 1234567891011121314151617181920212223242526class DeepNeuralNet(self, x, y, t, u, v, p, phi) (x, y, t, u, v, p, phi) = update(x, y, t, u, v, p, phi) (weights, biases, layers) = self.InitializeNN(weights, biases, layers) self.loss = MSE((u - u_pred)+(v - v_pred)+(p - p_pred)+(phil - phil_pred)) u_pred, v_pred = self.net_psi(x, y, t) p_pred = self.net_p(x, y, t) phil_pred = self.net_phil(x, y, t) Adam: #iterations ’L-BFGS-B’: max iterations = 500000def InitializeNN(self, layers) ...def NeuralNet(self, weights, biases) ...def net_u, net_v, net_p, net_phil(self, x, y, t) ...def Train(self, iterations) ...def predict_u, predict_v, predict_p, predict_phil(self, iterations) u_pred, v_pred, p_pred, phil_pred = self.sess.run(x, y, t)layers = [30 neurons X 9 layers](x_train, y_train, t_train, u_train, v_train, p_train, phil_train) = np.maxminscaler(singlebubbledata)model = DeepNeuralNet(x_train, y_train, t_train, u_train, v_train, p_train, phil_train)model.train(#iterations)t_pred = #target prediction timeu_pred, v_pred, p_pred, phil_pred = model.predict(x, y, t) @ t_pred II. for BubbleNet, the algorithms can be simplified to 1234567891011121314151617181920212223242526272829303132class BubbleNet(self, x, y, t, u, v, p, phi) (x, y, t, u, v, p, phi) = update(x, y, t, u, v, p, phi) (weights, biases, layers) = self.InitializeNN(weights, biases, layers) self.loss = MSE((u - u_pred)+(v - v_pred)+(p - p_pred)+(phil - phil_pred)) u_pred = self.net_u(x, y, t) v_pred = self.net_v(x, y, t) p_pred = self.net_p(x, y, t) phil_pred = self.net_phil(x, y, t) Adam: #iterations ’L-BFGS-B’: max iterations = 500000def InitializeNN(self, layers) ...def NeuralNet(self, weights, biases) ...def net_psi, net_p, net_phil(self, x, y, t) psi = net_psi(x, y, t) u = tf.gradients(psi, y)[0] v = - tf.gradients(psi, x)[0] ... return u, v, p, phildef Train(self, iterations) ...def predict_u, predict_v, predict_p, predict_phil(self, iterations) u_pred, v_pred, p_pred, phil_pred = self.sess.run(x, y, t)layers = [30 neurons X 9 layers](x_train, y_train, t_train, u_train, v_train, p_train, phil_train) = np.TDN(singlebubbledata)model = BubbleNet(x_train, y_train, t_train, u_train, v_train, p_train, phil_train)model.train(#iterations)t_pred = #target prediction timeu_pred, v_pred, p_pred, phil_pred = model.predict(x, y, t) @ t_pred Video IntroductionIf you want to explore BubbleNet vividly, watch the following YouTube video. (you can also view it on BiliBili and WeChat) Reference &amp; CitationPlease refer the following work if you wish to employ and customize BubbleNet: H. Zhai and G. Hu. (2021) Inferring micro-bubble dynamics with physics-informed deep learning. arXiv Preprint. arXiv:2105.07179 For (La)TeX users, please refer: 12345678@misc&#123;zhai2021BubbleNet, title=&#123;Inferring micro-bubble dynamics with physics-informed deep learning&#125;, author=&#123;Zhai, Hanfeng and Hu, Guohui&#125;, year=&#123;2021&#125;, eprint=&#123;2105.07179&#125;, archivePrefix=&#123;arXiv&#125;, primaryClass=&#123;physics.flu-dyn&#125;&#125; 12345678910@software&#123;zhai_hanfeng_2021_4769081, author = &#123;Zhai, Hanfeng&#125;, title = &#123;&#123;Data for BubbleNet code \\&amp; micro-bubbles system dynamics simulation&#125;&#125;, month = mar, year = 2021, publisher = &#123;Zenodo&#125;, doi = &#123;10.5281/zenodo.4769081&#125;, url = &#123;https://doi.org/10.5281/zenodo.4769081&#125;&#125;"},{"title":"NOTES","date":"2019-11-29T16:00:00.000Z","updated":"2021-04-27T13:28:52.011Z","comments":false,"path":"categories/note.html","permalink":"www.hanfengzhai.net/categories/note.html","excerpt":"","text":"Seminars _________________________ Neural Network on Multiscale Fluid Dynamics Predictions. Supervised by Guohui Hu. 4/26/2021: A short intro &amp; review of Weinan E‘s works. [PDF] 4/20/2021: A brief introduction of deep learningalgorithms applied to mechanics, seminar at Zhansheng Guo‘s lab. [PDF] 4/12/2021: Training &amp; prediction results of BubbleNet &amp; deep neural nets. [PDF] 3/22/2021: Physics-Informed neural network for microbubble dynamics. [PDF] 1/15/2021: Project plan for thesis (in Chinese). [PDF] 12/7/2020: Progress update on neural network predictions on acoustic pressure field. [PDF] 12/21/2020: Paper review of Fourier Neural Operator for Parametric Partial Differential Equations. [PDF] Biomechanics Research on Enamel Microstructure. Supervised by Dongsheng Zhang &amp; Dwayne D. Arola. Observation on enamel’s decussation bands. [PDF] Modelling on enamel’s structure in 3D. [PDF] Progress on the new observations and simulations. [PDF] New observations and strategies for structural modeling. [PDF] New observations and measurements for modeling. [PDF] Parameters measurements for microstructural modeling. [PDF] Reports for update on 3D printing on modeling. [PDF] Learning Notes ___________________________________ Computational Fluid Dynamics. Taught by Xiaoquan Yang. SHU 01826063 (2020). 1. Introduction to CFD. [PDF] 2. Nondimensionalization. [PDF] 3. Finite Volume Method. [PDF] 4. Finite Difference Method. [PDF] 5. Boundary Conditions. [PDF] 6. Artificial Dissipation. [PDF] 7. Meshing Transformation &amp; Viscosity Discretization. [PDF] 8. Implicit Difference Scheme. [PDF] Navier-Stokes Equation. [PDF] Smoothed-Particles Hydrodynamics. [Slides] | [BiliBili] | [YouTube] Finite Volume Method &amp; Shock Tube Problem. [Slides] | [BiliBili] | [YouTube] Mathematical Model of Neural Network. [PDF] Buckling of a Thin Plate. [Slides] | [BiliBili]"},{"title":"","date":"2019-11-29T16:00:00.000Z","updated":"2021-06-02T11:42:06.066Z","comments":true,"path":"EnamelFrac.html","permalink":"www.hanfengzhai.net/EnamelFrac.html","excerpt":"","text":"The role of rod decussation on crack deflection in enamelSiyong Liu, Hanfeng Zhai, Yuanzhi Xu, Bingbing An$^*$, Dongsheng Zhang$^*$, Dwayne D. Arola$^*$ STATEMENT: This is a joint project between SHU and UW by Profs. Zhang &amp; Arola. Siyong Liu is a PhD student under the supervision of Prof. Dongsheng Zhang. Hanfeng joined the project during most of his junior year, he assists Siyong in preparing the enamel specimen, observing the microstructures through SEM, modeling the enamel microstructure and conduct numerical simulations. The results shown on this site are generated by both Siyong, Hanfeng, and Bingbing. This project is under the supervision of both Dongsheng Zhang and Dwayne Arola. AbstractEnamel possesses ingenious hierarchical structure which gives rise to superior fracture resistance. Despite considerable efforts devoted to characterization of fracture behavior of enamel, the role of rod decussation in fracture of enamel is largely unknown. In this study, the features of rod decussation in the inner enamel are experimentally identified, and analyses of crack growth in enamel are carried out using a micromechanical model of enamel, in which the structural features of the outer enamel and rod decussation of the inner enamel are incorporated. We carry out calculations within a framework based on the extended finite element method, and the crack growth and crack path selection are natural outcomes of imposed loading. We show that crack deflection in enamel is controlled by rod decussation. For crack growth in the parazone, the crack path is oriented along the axis of enamel rods, leading to gross crack deflection. The microstructure of inner enamel with intermediate decussation angle enables multiple crack deflections, giving rise to enhanced toughness. For crack growth in the diazone, the transition in orientation of crack deflection occurs as decussation angle of enamel rods increases. The relatively straight crack path emerges in the case of the microstructure of enamel with intermediate decussation angle, leading to weak fracture resistance. It is further found that compared with the diazone, the gross crack deflection in the parazone provides greater contribution to fracture resistance of enamel. The findings of this study provide a good mechanistic understanding of the role of rod decussation in enamel. Methods &amp; ResultsStage I: SEM Observation &amp; ModelingStage II: Simulation &amp; FEM AnalysisStage III: Mechanical Analysis"}],"posts":[{"title":"","slug":"index","date":"2019-11-29T16:00:00.000Z","updated":"2021-06-02T10:28:25.028Z","comments":true,"path":"2019/11/30/index/","link":"","permalink":"www.hanfengzhai.net/2019/11/30/index/","excerpt":"","text":"Welcome to Hanfeng Zhai's page! ________________________________________________________________ I am currently a senior student of Theoretical and Applied Mechanics at Shanghai University. I conducted my undergraduate research with Prof. Guohui Hu. I am to join the M.S. in Mechanical Engineering at Cornell University, working with Prof. Jingjie Yeo. I’m currently working on predicting microbubble flow with deep learning as my undergraduate thesis (Chinese preprint), details see BubbleNet, updates available in my notes. For more details, please visit my bio. Curriculum Vitae. Recent News ________________________________ May 17th, 2021: Hanfeng got nominated as Outstanding Graduate of Shanghai, issued by Shanghai Ministry of Education, link for name list. Apr. 20th, 2021: Hanfeng gave a talk at Prof. Zhansheng Guo‘s lab on deep learning applied to mechanics. Feb. 23rd, 2021: Hanfeng served as scientific editor of QbitAI for one month. See articles (1, 2, 3, 4, 5) Feb. 19th, 2021: Hanfeng’s previous Chinese review article on solving PDEs with deep learning got forwarded by Sina Finance, CSDN, etc., etc. Jan. 11th, 2021: Hanfeng gave a talk at the closing ceremony of the academic forum. The Chinese Academy of Engineering academician Sun, Jinliang also sttend the ceremony. See photos. News also covered by Shanghai Education TV, Tencent, SHU, Guangming Daily, Wenhui, etc. Dec. 30th, 2020: Hanfeng delivered a presentation at Shanghai University Undergraduate Academic Forum titled “Computation Methods for Applied Mechanics Problem“ (See my slides, paper, poster). The news are covered by Shanghai University and Baidu. See my Tweets and details. Dec. 7th, 2020: Hanfeng is nominated as Outstanding Student, see SMES News. Nov. 30th, 2020: Hanfeng receives the Shanghai University Academic Scholarship (Top Class) award and Shanghai University Arts and Sports Scholarship. See SHU News. Oct. 21st, 2020: Our poster for The Design of The Lightweight Compressive Interlayer displayed in the hall of SMES as outstanding undergraduate’s course design. See picture. Aug. 5th, 2020: Our poster for Design of Intelligent Tuning Equipment for Stringed Instruments is selected as backup poster of Shanghai University for National College Student Innovation Forum. See our poster. Feb. 30th, 2020: Hanfeng delivered a online course for the students of Department of Mechanics as a course project of Theory of Elasticity. Click for backup video. Oct. 28th, 2019: Our poster for The Design of The Lightweight Compressive Interlayer is displayed in the Virtural Simulation Lab at School of Mechanics and Engineering Science. See poster and photo.","categories":[],"tags":[]}],"categories":[],"tags":[]}